<?xml version="1.0"?>
<net name="tf_model_0.55512" version="11">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="1,2560,1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x:0">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="functional_1/conv1d/Conv1D/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="functional_1/conv1d/Conv1D/ExpandDims/dim:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="functional_1/conv1d/Conv1D/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2560</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="functional_1/conv1d/Conv1D/ExpandDims/Transpose/value818015909" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="functional_1/conv1d/Conv1D/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2560</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d/Conv1D/ExpandDims:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="functional_1/conv1d/Conv1D/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 11" offset="40" size="1408" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d/Conv1D/ExpandDims_1:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="functional_1/conv1d/Conv1D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_2146" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1448" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Squeeze_2147" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_2148" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1456" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="functional_1/conv1d/Conv1D/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d/Conv1D/Squeeze:0">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="functional_1/conv1d/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 32" offset="1480" size="128" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="functional_1/conv1d/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d/BiasAdd:0">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="functional_1/leaky_re_lu/LeakyRelu/weights976916212" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1608" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="functional_1/leaky_re_lu/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/leaky_re_lu/LeakyRelu:0">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="functional_1/conv1d_1/Conv1D/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="functional_1/conv1d_1/Conv1D/ExpandDims/dim:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="functional_1/conv1d_1/Conv1D/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2560</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="functional_1/conv1d_1/Conv1D/ExpandDims/Transpose/value818415891" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="functional_1/conv1d_1/Conv1D/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2560</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_1/Conv1D/ExpandDims:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="functional_1/conv1d_1/Conv1D/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="1612" size="2048" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_1/Conv1D/ExpandDims_1:0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="functional_1/conv1d_1/Conv1D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_2153" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1448" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Squeeze_2154" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_2155" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1456" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="functional_1/conv1d_1/Conv1D/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_1/Conv1D/Squeeze:0">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="functional_1/conv1d_1/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 16" offset="3660" size="64" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_1/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="functional_1/conv1d_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_1/BiasAdd:0">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="functional_1/conv1d_2/Conv1D/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="functional_1/conv1d_2/Conv1D/ExpandDims/dim:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="functional_1/conv1d_2/Conv1D/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2560</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="functional_1/conv1d_2/Conv1D/ExpandDims/Transpose/value818816263" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="functional_1/conv1d_2/Conv1D/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2560</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_2/Conv1D/ExpandDims:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="functional_1/conv1d_2/Conv1D/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 1" offset="3724" size="64" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_2/Conv1D/ExpandDims_1:0">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="functional_1/conv1d_2/Conv1D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_2160" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1448" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Squeeze_2161" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_2162" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1456" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="functional_1/conv1d_2/Conv1D/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_2/Conv1D/Squeeze:0">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="functional_1/conv1d_2/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 16" offset="3660" size="64" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_2/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="functional_1/conv1d_2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_2/BiasAdd:0">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="functional_1/add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/add/add:0">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="functional_1/conv1d_3/Conv1D/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="functional_1/conv1d_3/Conv1D/ExpandDims/dim:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="functional_1/conv1d_3/Conv1D/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2560</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2560</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="functional_1/conv1d_3/Conv1D/ExpandDims/Transpose/value819216509" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="functional_1/conv1d_3/Conv1D/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2560</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_3/Conv1D/ExpandDims:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="functional_1/conv1d_3/Conv1D/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 1, 11" offset="3788" size="11264" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_3/Conv1D/ExpandDims_1:0">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="functional_1/conv1d_3/Conv1D" type="Convolution" version="opset1">
			<data strides="1, 4" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_2167" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1448" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Squeeze_2168" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_2169" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1456" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="functional_1/conv1d_3/Conv1D/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_3/Conv1D/Squeeze:0">
					<dim>1</dim>
					<dim>640</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="functional_1/conv1d_3/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 16" offset="15052" size="64" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_3/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="functional_1/conv1d_3/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_3/BiasAdd:0">
					<dim>1</dim>
					<dim>640</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="functional_1/leaky_re_lu_1/LeakyRelu/weights975316233" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1608" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="functional_1/leaky_re_lu_1/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/leaky_re_lu_1/LeakyRelu:0">
					<dim>1</dim>
					<dim>640</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="functional_1/conv1d_4/Conv1D/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="functional_1/conv1d_4/Conv1D/ExpandDims/dim:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="functional_1/conv1d_4/Conv1D/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="functional_1/conv1d_4/Conv1D/ExpandDims/Transpose/value819616500" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="functional_1/conv1d_4/Conv1D/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_4/Conv1D/ExpandDims:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="functional_1/conv1d_4/Conv1D/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f32" shape="48, 16, 1, 11" offset="15116" size="33792" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_4/Conv1D/ExpandDims_1:0">
					<dim>48</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="functional_1/conv1d_4/Conv1D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_2174" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1448" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Squeeze_2175" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_2176" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1456" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="functional_1/conv1d_4/Conv1D/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_4/Conv1D/Squeeze:0">
					<dim>1</dim>
					<dim>640</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="functional_1/conv1d_4/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 48" offset="48908" size="192" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_4/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="functional_1/conv1d_4/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_4/BiasAdd:0">
					<dim>1</dim>
					<dim>640</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="functional_1/leaky_re_lu_2/LeakyRelu/weights972116245" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1608" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="functional_1/leaky_re_lu_2/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/leaky_re_lu_2/LeakyRelu:0">
					<dim>1</dim>
					<dim>640</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="functional_1/conv1d_5/Conv1D/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="functional_1/conv1d_5/Conv1D/ExpandDims/dim:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="functional_1/conv1d_5/Conv1D/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="functional_1/conv1d_5/Conv1D/ExpandDims/Transpose/value820016506" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="functional_1/conv1d_5/Conv1D/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_5/Conv1D/ExpandDims:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="functional_1/conv1d_5/Conv1D/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f32" shape="24, 48, 1, 1" offset="49100" size="4608" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_5/Conv1D/ExpandDims_1:0">
					<dim>24</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="functional_1/conv1d_5/Conv1D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_2181" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1448" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Squeeze_2182" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_2183" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1456" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="functional_1/conv1d_5/Conv1D/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_5/Conv1D/Squeeze:0">
					<dim>1</dim>
					<dim>640</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="functional_1/conv1d_5/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 24" offset="53708" size="96" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_5/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="functional_1/conv1d_5/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_5/BiasAdd:0">
					<dim>1</dim>
					<dim>640</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="functional_1/conv1d_6/Conv1D/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="functional_1/conv1d_6/Conv1D/ExpandDims/dim:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="functional_1/conv1d_6/Conv1D/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="functional_1/conv1d_6/Conv1D/ExpandDims/Transpose/value820416146" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="functional_1/conv1d_6/Conv1D/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_6/Conv1D/ExpandDims:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="functional_1/conv1d_6/Conv1D/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f32" shape="24, 16, 1, 1" offset="53804" size="1536" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_6/Conv1D/ExpandDims_1:0">
					<dim>24</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="functional_1/conv1d_6/Conv1D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_2188" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1448" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Squeeze_2189" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_2190" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1456" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="functional_1/conv1d_6/Conv1D/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_6/Conv1D/Squeeze:0">
					<dim>1</dim>
					<dim>640</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="functional_1/conv1d_6/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 24" offset="55340" size="96" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_6/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="functional_1/conv1d_6/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_6/BiasAdd:0">
					<dim>1</dim>
					<dim>640</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="functional_1/add_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/add_1/add:0">
					<dim>1</dim>
					<dim>640</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="functional_1/conv1d_7/Conv1D/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="functional_1/conv1d_7/Conv1D/ExpandDims/dim:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="functional_1/conv1d_7/Conv1D/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="functional_1/conv1d_7/Conv1D/ExpandDims/Transpose/value820816371" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="functional_1/conv1d_7/Conv1D/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_7/Conv1D/ExpandDims:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="functional_1/conv1d_7/Conv1D/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 1, 11" offset="55436" size="25344" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_7/Conv1D/ExpandDims_1:0">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="functional_1/conv1d_7/Conv1D" type="Convolution" version="opset1">
			<data strides="1, 4" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_2195" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1448" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Squeeze_2196" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_2197" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1456" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="functional_1/conv1d_7/Conv1D/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_7/Conv1D/Squeeze:0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="functional_1/conv1d_7/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 24" offset="80780" size="96" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_7/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="functional_1/conv1d_7/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_7/BiasAdd:0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="functional_1/leaky_re_lu_3/LeakyRelu/weights974916218" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1608" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="functional_1/leaky_re_lu_3/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/leaky_re_lu_3/LeakyRelu:0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="functional_1/conv1d_8/Conv1D/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="functional_1/conv1d_8/Conv1D/ExpandDims/dim:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="functional_1/conv1d_8/Conv1D/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>160</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="functional_1/conv1d_8/Conv1D/ExpandDims/Transpose/value821215921" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="functional_1/conv1d_8/Conv1D/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>160</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_8/Conv1D/ExpandDims:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="functional_1/conv1d_8/Conv1D/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f32" shape="64, 24, 1, 11" offset="80876" size="67584" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_8/Conv1D/ExpandDims_1:0">
					<dim>64</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="functional_1/conv1d_8/Conv1D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_2202" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1448" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Squeeze_2203" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_2204" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1456" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="functional_1/conv1d_8/Conv1D/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_8/Conv1D/Squeeze:0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="functional_1/conv1d_8/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 64" offset="148460" size="256" />
			<output>
				<port id="0" precision="FP32" names="functional_1/conv1d_8/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="functional_1/conv1d_8/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1/conv1d_8/BiasAdd:0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="functional_1/leaky_re_lu_4/LeakyRelu/weights976116143" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1608" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="functional_1/leaky_re_lu_4/LeakyRelu" type="PReLU" version="opset1">
			<input>
